replace cert_ prefix with vault_pki_ prefix
Reflects purpose and functionality better. Also update readme.

Signed-off-by: Jakub Sokołowski <jakub@status.im>
